Repository: giellalt/corpus-sme
Catalog: tmx/eng/admin/depts/regjeringen.no/ossodagat_id_366.html.tmx
Source language: sme
Languages: eng

source: Ossodagat - regjeringen.no
eng: Department of Employer Policy

source: E-poasta:
eng: E-mail:

source: Bargoaddipolitihkalaš ossodat
eng: Department of ICT Policy and Public Sector Reform

source: Girkoossodat
eng: Communication Unit

source: Telefovdna:
eng: Telephone:

source: Gilvopolitihkalaš ossodat
eng: Department of Competition Policy

source: Sámi ja minoritehtapolitihkalaš ossodat
eng: The Department of Sami and Minority Affairs

source: Stáhtahálddahusossodat
eng: Department of Government Services
